; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v4)
		(pred_5 ?v8)
		(pred_1 ?v6)
		(pred_2 ?v6)
		(pred_4 ?v8 ?v6)
		(pred_3)
		(pred_6 ?v8))

   (:action op_1
       :parameters  (?v1 ?v2)
       :precondition (and (not-eq ?v1 ?v2) 
                          (pred_1 ?v1) (pred_1 ?v2) (pred_2 ?v1))
       :effect (and  (pred_2 ?v2)
		     (not (pred_2 ?v1))))


   (:action op_3
       :parameters (?v5 ?v7)
       :precondition  (and  (pred_5 ?v5) (pred_1 ?v7)
			    (pred_4 ?v5 ?v7) (pred_2 ?v7) (pred_3))
       :effect (and (pred_6 ?v5)
		    (not (pred_4 ?v5 ?v7)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v5  ?v7)
       :precondition  (and  (pred_5 ?v5) (pred_1 ?v7)
			    (pred_6 ?v5) (pred_2 ?v7))
       :effect (and (pred_4 ?v5 ?v7)
		    (pred_3)
		    (not (pred_6 ?v5)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_02 obj_04 obj_01 obj_03 
          obj_07 obj_06 obj_05 
)
(:init
(pred_1 obj_02)
(pred_1 obj_04)
(pred_1 obj_01)
(pred_1 obj_03)
(pred_5 obj_07)
(pred_5 obj_06)
(pred_5 obj_05)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(pred_3)
(pred_4 obj_07 obj_02)
(pred_4 obj_06 obj_01)
(pred_4 obj_05 obj_02)
(pred_2 obj_02)
)
(:goal
(and
(pred_4 obj_07 obj_04)
(pred_4 obj_06 obj_03)
(pred_4 obj_05 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_07 obj_04) (pred_2 obj_01))
    (sometime-before  (pred_4 obj_06 obj_03) (pred_2 obj_04))
    (sometime-before  (pred_4 obj_05 obj_01) (pred_2 obj_04))
  )
)
)

; plan
1. (op_3 obj_05 obj_02)
   deleted: (pred_4 obj_05 obj_02) (pred_3)
   added: (pred_6 obj_05)
   goals met: 0 of 3
2. (op_1 obj_02 obj_01)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_01)
   goals met: 0 of 3
3. (op_1 obj_01 obj_04)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_04)
   goals met: 0 of 3
4. (op_2 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_4 obj_05 obj_04) (pred_3)
   goals met: 0 of 3
5. (op_1 obj_04 obj_02)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_02)
   goals met: 0 of 3
6. (op_3 obj_07 obj_02)
   deleted: (pred_4 obj_07 obj_02) (pred_3)
   added: (pred_6 obj_07)
   goals met: 0 of 3
7. (op_1 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 0 of 3
8. (op_2 obj_07 obj_04)
   deleted: (pred_6 obj_07)
   added: (pred_4 obj_07 obj_04) (pred_3)
   goals met: 1 of 3
9. (op_3 obj_05 obj_04)
   deleted: (pred_4 obj_05 obj_04) (pred_3)
   added: (pred_6 obj_05)
   goals met: 1 of 3
10. (op_1 obj_04 obj_03)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_03)
   goals met: 1 of 3
11. (op_1 obj_03 obj_01)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_01)
   goals met: 1 of 3
12. (op_2 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_4 obj_05 obj_01) (pred_3)
   goals met: 2 of 3
13. (op_3 obj_06 obj_01)
   deleted: (pred_4 obj_06 obj_01) (pred_3)
   added: (pred_6 obj_06)
   goals met: 2 of 3
14. (op_1 obj_01 obj_03)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_03)
   goals met: 2 of 3
15. (op_2 obj_06 obj_03)
   deleted: (pred_6 obj_06)
   added: (pred_4 obj_06 obj_03) (pred_3)
   goals met: 3 of 3
